Hi @tmccombs,

no problem! I ran also a test with 5.80.0 and was not able to reproduce (see below). Would it be possible for you to add the debug logs for your terraform plan/ apply runs? [Here](https://developer.hashicorp.com/terraform/internals/debugging) you can find details for enabling the debug log mode.

```shell
❯ terraform version
Terraform v1.7.2
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v5.80.0

Your version of Terraform is out of date! The latest version
is 1.10.4. You can update by downloading from https://www.terraform.io/downloads.html
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.example will be created
  + resource "aws_lambda_event_source_mapping" "example" {
      + arn                           = (known after apply)
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:eu-central-1:<redacted>:MyQueue"
      + function_arn                  = (known after apply)
      + function_name                 = "myfunctionName"
      + function_response_types       = [
          + "ReportBatchItemFailures",
        ]
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_lambda_event_source_mapping.example: Creating...
aws_lambda_event_source_mapping.example: Still creating... [10s elapsed]
aws_lambda_event_source_mapping.example: Creation complete after 14s [id=02478444-d4b4-4fbf-aec3-a97e31d7d39f]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

❯ terraform apply
aws_lambda_event_source_mapping.example: Refreshing state... [id=02478444-d4b4-4fbf-aec3-a97e31d7d39f]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```